
### Инструкции php заключаются в 
| <?php… ?>

| <?
| код PHP
| ?>

| <%
| код PHP
| %>

| <SCRIPT LANGUAGE=”php”>
| код PHP
| </SCRIPT>

. Подключение файлов
| include(‘/path/to/file‘);            #при обнаружении ошибки выдают 
| include_once(‘/path/to/file’);       #сообщение и продолж исполнен сценария

| reqiure(‘/path/to/file’);            #при обнаружении ошибки выдают сообщ
| reqiure_once(‘/path/to/file’);       #и прекращают исполнен сценарий

| include_once(‘/path/to/file’);       #подключают файл
| reqiure_once(‘/path/to/file’);       #только один раз

| http://www.example.com/index.php?file=main.html    #все что после ? - это параметры

. <ins> Безопасность входных данных </ins> <br>
Например входные данные проверяются в header.php. <br>
Если header.php вызывается через index.php то входные данные проверяются, но если напрямую обратится к footer.php, который не подключает header.php то есть вариант ломануть сайт.

. <ins>В PHP не указывается тип создаваемых переменных.</ins></br> 
Тип определяется интерпретатором.
| $var = 4;			//число
| $var = 3.14			//вещественное число
| $var = ‘это строка’	//строка
| $var = ‘45’			//строка

| isset($var) - проверяет присвоено ли значение переменной $var
| define(‘PI’, 3.14) - создает константу PI (константы неизменны на всем времени ее жизни)

. <ins>Операции сравнения:</ins>
if - else
if - elseif

| switch (переменная)	# если после сравнения if-else выполняется            
| {
|     case значение-1;
|         операторы-1;
|         break;
|     case значение-2;
|         операторы-2;
|         break;
| [default; оператор]
| }

. <ins>Классы:</ins><br>
| ![Image alt](https://github.com/bfg2000/FAQ_HACK/blob/main/php/images/1.png) 

. <ins>включить отображение ошибок:</ins> php.ini - error_reporting установить параметр E_ALL

. <ins>Переменные окружения:</ins>
DOUMENT_ROOT - путь к каталогу на сервере, где расположен сценарий
SCRIPT_FILENAME - путь к исполняемому файлу на сервере
SERVER_ADDR - IP-адрес сервера
SERVER_PORT - порт сервера 
SERVER_NAME - имя хоста сервера
SERVER_PROTOCOL - версия HTTP-протокола
REMOTE_ADDR - IP-адрес компа, запросившего сценарий
REMOTE_PORT - порт удаленного компа с которым установлено соединение
REQUEST_METHOD - метод (GET, POST) с помощью которого запрошен сценарий
REQUEST_URL - URL-путь к файлу без имени сервера
QUERTY_STRING - строка запроса которая содержит список параметров, переданных запросу. Параметры разделены амперсандами (&). 
HTTP_HOST - имя сервера, может совпадать с SERVER_NAME
HTTP_USER_AGENT - строка идентифицирующая браузер
HTTP_ACCEPT - перечень файлов которые может обрабатывать клиент

. Вывод на экран значение переменных:
| <?= $_SERVER(‘DOCUMENT_ROOT’)?>
| <?= $_SERVER(‘SCRIPT_FILENAME’)?>


. <ins>isset()</ins> - сравнение переменной  на существование значения. Если true, то переменная не существует.
. <ins>type=”hidden”</ins> - тип (невидимый). Создает невидимое поле (например поле ввода)

параметры, передаваемые методом POST доступны ч\з массив $_POST(‘имя_переменной’)
параметры, передаваемые методом GET доступны ч\з массив $_GET(‘имя_переменной’)

Глобальные переменные принимаются php по методу GET, даже если в скрипте  указан метод POST. 
Также, по умолчанию в php, если переменная не объявлена, но происходит запрос к ней то она создается с тем параметром который передается в запросе. 

. <ins>session_star()</ins> - авторизация пользователя на сайте.<br>
Результат  - <i>true</i> или <i>false</i>
Значения переменных помещается в массив $_SESSION[имя переменной] = значение

### Сеансы
session_start() - функия для запуска сеанса пользователя
| $_SESSION("имя переменной") = згачение;

. <ins>SID</ins> - идентификатор сеанса.  После запуска сеанса SID сохраняется в cookie и каждая полседующая страница после выполнения session_start() находит SID и ч\з него получает доступ к сеансовым параметрам.

### Cookies
| int setcookie {
|  string cookiename       #имя переменной, обязательный параметр
|  [, string value]        #значение переменной
|  [, integer lifetime]    #время жизни
|  [, string path]         #путь
|  [, string domain]       #домен
|  [, integer secure]      #параметр безопасности: 0-разреш прд по http, 1-запрещена
| }

. Удаление cookie - необходимо установить параметр с нужным именем и указать нулевое значение жизни.
| setcookie("access");

или указать время жизни в прощлом
| setcookie("access", 0, mktime(0,0,0,1,1,2000));

Работу с cookie необходимо реализовывать в самом начале сценария. Если до php-кода, устанавливающего cookie будет присутствовать html-код, то код выдаст ошибку.

### Файлы

. <ins>Открытие файла</ins>
fopen() - функция открытия файла

| int fopen(string filename, string mode [, int use_include_path])

. mode - режим открытия файла, принимает занчения:<br>
  r - чтение<br>
  r+ - чтение и запись<br>
  w - запись, если файл существует, то все содержимое уничтожается<br>
  w+ - чтение и запись, если существует, то все содержимое уничтожается<br>
  a - открыть файл для записи, не уничтожает содержимое, дописывает в конец<br>
  a+ - чтение и запись, дописывает в конец<br>
  b - обрабатывает бинарный файл, необходимо для работы с бинарниками windows<br>
  
. use_include_path - искать файл в каталогах, указанных в директиве include_path конфигурационного файла php.ini
Если открываемый файл не существует, то он будет создан (при наличии прав на запись у сервера)

. <ins>Закрытие файла</ins>
| int fclose (int f)
Функции передается дескриптор закрываемого файла. Если успешно возвращает true, иначе false.

. <ins>Чтение данных</ins>
| fread()
| fgetc()
| fgets()
| fgetss()

. <ins>string <b>fread</b>(int f, int lenght)</ins><br>
Параметры:<br>
- дескриптор файла из котрого надо производить чтение<br>
- кол-во необходимых символов<br>
При вызове ф-ции указатель текущей позиции смещается в конец прочитанных данных и при следующем вызове ф-ции будут читаться следующие данные.

. <ins>string <b>fgetc</b>(int f)</ins>
Возвращает один символ из файла, поэтому указывается только дескриптор файла из которого надо читать.

. <ins>string <b>fgets</b>(int f, int lenght)</ins><br>
Читает файл до символа перевода строки.

. <ins>string <b>fgetss</b>(int f, lenght[, string allowable])</ins>
allowable - список разрешенных тегов через запятую.<br>
Читает файл до символа перевода строки, при этом удаляет из прочитанных данных все HTML и PHPтеги.

| array file(string filename [, int use_include_path]) - весь файл разбивается в массив

. <ins>Запись данных</ins>
| int fwrite(int f,stringws [, int lenght])

Параметры:<br>
- дескриптор файла
- строка которую надо записать
- кол-во записываемых данных, если параметр не задан, то будет записана вся сторка

Если запись данных успешна, то true иначе false<br>
Данные пишутся в текущую позиицю. 

. <ins>Позиционриовние в файле</ins>
| leof() - возвращает true, если текущая позиция соответсвует концу фала, иначе false.<br>
<br>

| int <b>fseek</b>(int f, int offset [, int whence]) - устанавливает курсор в соответсвующую позицию<br>
f - дескриптор файла<br>
offsset - кол-во символов на которое нужно передвинуть указатель. Направление движения зависит от последнего параметра функции<br>
whence - откуда и куда надо перемещаться:<br>
- SEEK_SET - движение с начала файла (по умолчанию) <br>
- SEEK_CUR - движение от текущей позиции. Двигаться в начало указать отрицательное значение<br>
- SEEK_END - движение от конца файла.

| ftell() - определяет текущую позицию, возвращает кол-во символов от начала файла.
<br>
| rewind() - Переместиться в начало файла.
 







  
